In [1]:
# !pip install sqlalchemy psycopg2 panda

In [2]:
import sqlalchemy
from sqlalchemy import create_engine
db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

In [3]:
result_set = db.execute("SELECT * FROM city")  
# for r in result_set:  
    # print(r)

In [4]:
import psycopg2 as pg
import pandas as pd

df = pd.read_sql('select * from city',con=connection_sqlalchemy)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

**Ile kategorii filmów mamy w wypożyczalni?**

In [5]:
# df = pd.read_sql('select count(*) from category',con=connection_sqlalchemy)
df = pd.read_sql("""select count (distinct category_id) from film_category where film_id in (select distinct film_id from inventory)""",con=connection_sqlalchemy)
df

   count
0     16

**Wyświetl listę kategorii w kolejności alfabetycznej**

In [6]:
df = pd.read_sql("""select * from category order by name asc""",con=connection_sqlalchemy)
df

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

**Znajdź najstarszy i najmłodszy film do wypożyczenia**

In [7]:
# df = pd.read_sql("""select * from category""",con=connection_sqlalchemy)
df = pd.read_sql("""select * from film where film_id in (select film_id from inventory) order by release_year desc limit 1""",con=connection_sqlalchemy)
df

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...

In [8]:
df = pd.read_sql("""select * from film order by release_year asc limit 1""",con=connection_sqlalchemy)
df

,film_id,title,description,release_year,language_id,rental_duration,rental_rate,length,replacement_cost,rating,last_update,special_features,fulltext
0,133,Chamber Italian,A Fateful Reflection of a Moose And a Husband ...,2006,1,7,4.99,117,14.99,NC-17,2013-05-26 14:50:58.951,[Trailers],'chamber':1 'fate':4 'husband':11 'italian':2 ...

**Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?**

In [9]:
df = pd.read_sql("""select count(*) from rental where rental_date >= \'2005-07-01\' and rental_date < \'2005-08-01\'""",con=connection_sqlalchemy)
df

   count
0   6709

**Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?**

In [10]:
df = pd.read_sql("""select count(*) from rental where rental_date >= \'2010-01-01\' and rental_date < \'2011-02-01\'""",con=connection_sqlalchemy)
df

   count
0      0

**Znajdź największą płatność wypożyczenia.**

In [11]:
df = pd.read_sql("""select * from payment order by amount desc limit 1""",con=connection_sqlalchemy)
df

,payment_id,customer_id,staff_id,rental_id,amount,payment_date
0,20403,362,1,14759,11.99,2007-03-21 21:57:24.996577

**Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.**

In [12]:
df = pd.read_sql(
    """select * from customer where address_id in
        (select address_id from address where city_id in
            (select city_id from city where country_id in
                (select country_id from country where country=\'Poland\' or country=\'Nigeria\' or country=\'Bangladesh\')))""",con=connection_sqlalchemy)
# df = pd.read_sql("""select * from country where country = \"Poland\"""",con=connection_sqlalchemy)
df

,customer_id,store_id,first_name,last_name,email,address_id,activebool,create_date,last_update,active
0,18,2,Carol,Garcia,carol.garcia@sakilacustomer.org,22,True,2006-02-14,2013-05-26 14:49:45.738,1
1,21,1,Michelle,Clark,michelle.clark@sakilacustomer.org,25,True,2006-02-14,2013-05-26 14:49:45.738,1
2,80,1,Marilyn,Ross,marilyn.ross@sakilacustomer.org,84,True,2006-02-14,2013-05-26 14:49:45.738,1
3,103,1,Gladys,Hamilton,gladys.hamilton@sakilacustomer.org,107,True,2006-02-14,2013-05-26 14:49:45.738,1
4,128,1,Marjorie,Tucker,marjorie.tucker@sakilacustomer.org,132,True,2006-02-14,2013-05-26 14:49:45.738,1
5,156,1,Bertha,Ferguson,bertha.ferguson@sakilacustomer.org,160,True,2006-02-14,2013-05-26 14:49:45.738,1
6,198,2,Elsie,Kelley,elsie.kelley@sakilacustomer.org,202,True,2006-02-14,2013-05-26 14:49:45.738,1
7,232,2,Constance,Reid,constance.reid@sakilacustomer.org,236,True,2006-02-14,2013-05-26 14:49:45.738,1
8,250,2,Jo,Fowler,jo.fowler@sakilacustomer.org,254,True,2006-02-14,2013-05-26 14:49:45.738,1
9,270,1,Leah,Curtis,leah.curtis@sakilacustomer.org,275,True,2006-02-14,2013-05-26 14:49:45.738,1
10,277,2,Olga,Jimenez,olga.jimenez@sakilacustomer.org,282,True,2006-02-14,2013-05-26 14:49:45.738,1
11,280,2,Tracey,Barrett,tracey.barrett@sakilacustomer.org,285,True,2006-02-14,2013-05-26 14:49:45.738,1
12,284,1,Sonia,Gregory,sonia.gregory@sakilacustomer.org,289,True,2006-02-14,2013-05-26 14:49:45.738,1
13,286,1,Velma,Lucas,velma.lucas@sakilacustomer.org,291,True,2006-02-14,2013-05-26 14:49:45.738,1
14,318,1,Brian,Wyman,brian.wyman@sakilacustomer.org,323,True,2006-02-14,2013-05-26 14:49:45.738,1
15,329,2,Frank,Waggoner,frank.waggoner@sakilacustomer.org,334,True,2006-02-14,2013-05-26 14:49:45.738,1
16,332,1,Stephen,Qualls,stephen.qualls@sakilacustomer.org,337,True,2006-02-14,2013-05-26 14:49:45.738,1
17,380,1,Russell,Brinson,russell.brinson@sakilacustomer.org,385,True,2006-02-14,2013-05-26 14:49:45.738,1
18,409,2,Rodney,Moeller,rodney.moeller@sakilacustomer.org,414,True,2006-02-14,2013-05-26 14:49:45.738,1
19,501,1,Ruben,Geary,ruben.geary@sakilacustomer.org,506,True,2006-02-14,2013-05-26 14:49:45.738,1
20,558,1,Jimmie,Eggleston,jimmie.eggleston@sakilacustomer.org,564,True,2006-02-14,2013-05-26 14:49:45.738,0
21,562,1,Wallace,Slone,wallace.slone@sakilacustomer.org,568,True,2006-02-14,2013-05-26 14:49:45.738,1
22,571,2,Johnnie,Chisholm,johnnie.chisholm@sakilacustomer.org,577,True,2006-02-14,2013-05-26 14:49:45.738,1
23,572,1,Sidney,Burleson,sidney.burleson@sakilacustomer.org,578,True,2006-02-14,2013-05-26 14:49:45.738,1

**Gdzie mieszkają członkowie personelu?**

In [13]:
df = pd.read_sql(
    """select * from address where address_id in
        (select address_id from staff)""",con=connection_sqlalchemy)
df

,address_id,address,address2,district,city_id,postal_code,phone,last_update
0,3,23 Workhaven Lane,None,Alberta,300,,14033335568,2006-02-15 09:45:30
1,4,1411 Lillydale Drive,None,QLD,576,,6172235589,2006-02-15 09:45:30

**Ilu pracowników mieszka w Argentynie lub Hiszpanii?**

In [14]:
df = pd.read_sql(
    """select count(*) from staff where address_id in
        (select address_id from address where city_id in
            (select city_id from city where country_id in
                (select country_id from country where country=\'Argentina\' or country=\'Spain\')))""",con=connection_sqlalchemy)
df

   count
0      0

**Jakie kategorie filmów zostały wypożyczone przez klientów?**

In [15]:
df = pd.read_sql(
    """select * from category where category_id in
        (select category_id from film_category where film_id in
            (select film_id from inventory where inventory_id in
                (select inventory_id from rental)))""",con=connection_sqlalchemy)
df

    category_id         name         last_update
0             8       Family 2006-02-15 09:46:27
1            16       Travel 2006-02-15 09:46:27
2            15       Sports 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             1       Action 2006-02-15 09:46:27
5            13          New 2006-02-15 09:46:27
6             5       Comedy 2006-02-15 09:46:27
7            11       Horror 2006-02-15 09:46:27
8             3     Children 2006-02-15 09:46:27
9            14       Sci-Fi 2006-02-15 09:46:27
10           12        Music 2006-02-15 09:46:27
11           10        Games 2006-02-15 09:46:27
12            9      Foreign 2006-02-15 09:46:27
13            6  Documentary 2006-02-15 09:46:27
14            2    Animation 2006-02-15 09:46:27
15            7        Drama 2006-02-15 09:46:27

**Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.**

In [16]:
df = pd.read_sql(
    """select * from category where category_id in
        (select category_id from film_category where film_id in
            (select film_id from inventory where inventory_id in
                (select inventory_id from rental where customer_id in
                    (select customer_id from customer where address_id in
                        (select address_id from address where city_id in
                            (select city_id from city where country_id in
                                (select country_id from country where country=\'United States\')))))))""",con=connection_sqlalchemy)
# df = pd.read_sql("""select * from country where country = \'United States\'""",con=connection_sqlalchemy)
df

    category_id         name         last_update
0             8       Family 2006-02-15 09:46:27
1            16       Travel 2006-02-15 09:46:27
2            15       Sports 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             1       Action 2006-02-15 09:46:27
5            13          New 2006-02-15 09:46:27
6             5       Comedy 2006-02-15 09:46:27
7            11       Horror 2006-02-15 09:46:27
8             3     Children 2006-02-15 09:46:27
9            14       Sci-Fi 2006-02-15 09:46:27
10           12        Music 2006-02-15 09:46:27
11           10        Games 2006-02-15 09:46:27
12            9      Foreign 2006-02-15 09:46:27
13            6  Documentary 2006-02-15 09:46:27
14            2    Animation 2006-02-15 09:46:27
15            7        Drama 2006-02-15 09:46:27

**Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley**

In [17]:
df = pd.read_sql(
    """select title from film where film_id in
        (select film_id from film_actor where actor_id in
            (select actor_id from actor where (first_name=\'Olympia\' and last_name=\'Pfeiffer\') or (first_name=\'Julia\' and last_name=\'Zellweger\') or (first_name=\'Ellen\' and last_name=\'Presley\') ))""",con=connection_sqlalchemy)
df

                title
0   Caribbean Liberty
1      Roots Remember
2        Outlaw Hanky
3        Women Dorado
4    Empire Malkovich
..                ...
64  Contact Anonymous
65    Majestic Floats
66       Deep Crusade
67   Effect Gladiator
68     Express Lonely

[69 rows x 1 columns]